[
  {"name": "King Vijaya", "slug": "vijaya", "kingdom": "tambapanni", "reign": "543–505 BCE", "biography": "King Vijaya is the legendary first king of Sri Lanka, known for founding the Sinhalese people. According to the Mahāvaṃsa, he was the son of King Sinhabahu of Sinhapura in India. Due to his unruly behavior, he was banished with 700 followers. They landed in Lanka, at a site named Tambapanni, on the day of the Buddha's Parinirvana. There, he and his followers defeated the native Yakkhas with the help of the Yakkha princess Kuveni, whom he married. He established the Kingdom of Tambapanni, but later abandoned Kuveni and their two children to marry a princess from the Pandyan kingdom in Madurai, India, to legitimize his rule. His followers also married women from Madurai. This union is considered the origin of the Sinhalese people. He ruled for 38 years, and his reign is marked as the beginning of the recorded history of Sri Lanka."},
  {"name": "Upatissa (regent)", "slug": "upatissa-regent", "kingdom": "tambapanni", "reign": "505–504 BCE", "biography": "Upatissa was a chief minister of King Vijaya and the regent of Sri Lanka for one year after Vijaya's death. He was the foremost of the ministers and founded the city of Upatissa Nuwara, which became the second capital of the kingdom. He governed the kingdom from this city while awaiting the arrival of Vijaya's designated successor, Panduvasudeva, from India. His regency was a crucial transitional period that ensured the continuity of the monarchy."},
  {"name": "King Panduvasudeva", "slug": "panduvasudeva", "kingdom": "upatissa-nuwara", "reign": "504–474 BCE", "biography": "Panduvasudeva was the first monarch of the Kingdom of Upatissa Nuwara, reigning for 30 years. He was the nephew of his predecessor, King Vijaya, and was summoned from Sinhapura, India, to continue the royal lineage. He arrived in Sri Lanka with 32 followers and later married Princess Buddhakachchana, a relative of the Buddha, who arrived with her own retinue. Their marriage and his coronation solidified the Vijayan dynasty. Together, they had ten sons and one daughter, Unmada Chitra. His reign was foundational for the new kingdom, establishing a stable succession and strengthening ties with Indian royalty."},
  {"name": "King Abhaya", "slug": "abhaya", "kingdom": "upatissa-nuwara", "reign": "474–454 BCE", "biography": "Abhaya was the eldest son of King Panduvasudeva and succeeded his father as the king of Upatissa Nuwara, ruling for 20 years. He was chosen by his brothers to be the monarch and was known as a just and benevolent ruler. His reign ended when he was deposed by his nephew, Pandukabhaya, who feared that Abhaya would not cede the throne. Despite this, Pandukabhaya later appointed him to the position of 'Nagaraguttika' or guardian of the capital city, Anuradhapura, demonstrating a level of reconciliation and respect between them."},
  {"name": "Tissa (regent)", "slug": "tissa-regent", "kingdom": "upatissa-nuwara", "reign": "454–437 BCE", "biography": "Tissa was the younger brother of King Abhaya and became the regent of Upatissa Nuwara after Abhaya was deposed. He was one of the ten sons of King Panduvasudeva. His time as regent was defined by a prolonged power struggle with his nephew, Pandukabhaya, the son of their sister Unmada Chitra. Tissa and his other brothers waged war against Pandukabhaya for seventeen years, a conflict that ultimately ended in Tissa's defeat and death. His regency represents the final period of the Upatissa Nuwara kingdom before the capital shifted to Anuradhapura under Pandukabhaya."},
  {"name": "King Pandukabhaya", "slug": "pandukabhaya", "kingdom": "anuradhapura", "reign": "437–367 BCE", "biography": "Pandukabhaya is a legendary king of Sri Lanka and the first monarch of the Anuradhapura Kingdom. His story is one of destiny and perseverance; born to Princess Unmada Chitra, he was hidden at birth to protect him from his uncles, who had been foretold that he would kill them. Raised in secrecy, he eventually waged a seventeen-year war against his uncles, defeated them, and unified the island. He established Anuradhapura as his capital, a city he meticulously planned and developed. His reign of 70 years was marked by significant achievements, including the construction of reservoirs (such as the Abhaya Wewa), the establishment of a formal administrative system, and the peaceful integration of different clans. He is considered one of the most important early kings of Sri Lanka."},
  {"name": "King Mutasiva", "slug": "mutasiva", "kingdom": "anuradhapura", "reign": "367–307 BCE", "biography": "Mutasiva was a king of the Anuradhapura Kingdom who enjoyed a long and peaceful reign of 60 years. He was the son of the illustrious King Pandukabhaya. His most significant contribution was the creation of the Mahamevnāwa (Great Clouds) Park in Anuradhapura, a beautifully landscaped garden that he laid out with fruit and flowering trees. This park would later become a site of immense religious importance, as it was where the sacred Bodhi tree was planted during the reign of his successor. Mutasiva had ten sons and two daughters, and several of his sons, including Devanampiya Tissa, Uttiya, and Mahasiva, would go on to rule the kingdom in succession."},
  {"name": "King Devanampiya Tissa", "slug": "devanampiya-tissa", "kingdom": "anuradhapura", "reign": "307–267 BCE", "biography": "Devanampiya Tissa, whose name means 'Beloved of the Gods,' was a pivotal monarch of the Anuradhapura Kingdom, best known for officially introducing Buddhism to Sri Lanka. He was the son of King Mutasiva and maintained a close friendship with the Mauryan Emperor Ashoka of India. The most significant event of his reign was the arrival of Arahat Mahinda, Ashoka's son, who converted the king and his court to Buddhism at the historic site of Mihintale. Following his conversion, Devanampiya Tissa became a great patron of the faith, establishing the Mahavihara monastery and building the Thuparama stupa, the first of its kind in Sri Lanka. His reign also saw the arrival of Sanghamitta, Ashoka's daughter, who brought a sapling of the sacred Bodhi Tree from Bodh Gaya, which was planted in Anuradhapura and is revered to this day. His actions firmly rooted Buddhism in Sri Lankan soil, shaping the island's culture and history for centuries.", "media": []},
  {"name": "King Uttiya", "slug": "uttiya", "kingdom": "anuradhapura", "reign": "267–257 BCE", "biography": "Uttiya was a king of the Anuradhapura Kingdom who succeeded his elder brother, the renowned King Devanampiya Tissa. His ten-year reign is historically significant primarily because it marks the passing of the two central figures who introduced Buddhism to Sri Lanka: Arahant Mahinda and his sister, Sanghamitta Theri. Arahant Mahinda passed away in the eighth year of Uttiya's reign, and the king held a grand funeral for him, building a stupa on the site of his cremation at Mihintale. Sanghamitta Theri passed away the following year, and she was also honored with a stupa. These events underscore the consolidation of Buddhism as the state religion during his time."},
  {"name": "King Mahasiva", "slug": "mahasiva", "kingdom": "anuradhapura", "reign": "257–247 BCE", "biography": "Mahasiva was a king of the Anuradhapura Kingdom who reigned for ten years. He was another son of King Mutasiva and ascended the throne after his brother Uttiya. Like his brothers who reigned before him, Mahasiva was a pious king. According to the chronicles, he was a great supporter of the monk Bhaddasala, for whom he built the Bhaddasala temple in Anuradhapura. His reign is noted for its stability and continuation of the royal family's patronage of Buddhism. He was succeeded by his younger brother, Suratissa."},
  {"name": "King Suratissa", "slug": "suratissa", "kingdom": "anuradhapura", "reign": "247–237 BCE", "biography": "Suratissa was a king of the Anuradhapura Kingdom who succeeded his elder brother, Mahasiva. He was a devout follower of Buddhism and is credited with building numerous viharas (monasteries) throughout his kingdom, totaling around 500 religious shrines. His reign, however, came to an abrupt and violent end. Two horse traders from South India, named Sena and Guttika, mounted an invasion, defeated King Suratissa in battle, and usurped the throne. This event marks the first recorded instance of a foreign invasion and rule over the Anuradhapura Kingdom, breaking the Vijayan dynasty for a period of 22 years."},
  {"name": "Sena and Guttika", "slug": "sena-guttika", "kingdom": "anuradhapura", "reign": "237–215 BCE", "biography": "Sena and Guttika were two Tamil horse traders from South India who became the first recorded foreign rulers of Anuradhapura. After arriving on the island for trade, they organized an army, defeated and killed King Suratissa, and usurped the Sinhalese throne. They ruled jointly for 22 years. The chronicles describe their reign as unrighteous and oppressive, a period during which the local populace suffered. Their rule was eventually ended by Asela, the younger brother of the slain King Suratissa, who raised an army and defeated the two invaders to restore the Vijayan dynasty."},
  {"name": "King Asela", "slug": "asela", "kingdom": "anuradhapura", "reign": "215–205 BCE", "biography": "Asela was a king of the Anuradhapura Kingdom who heroically restored the Vijayan dynasty after a period of foreign rule. He was the youngest of the nine sons of King Mutasiva. After the two Tamil invaders, Sena and Guttika, had ruled for 22 years, Asela raised an army, defeated them in battle, and reclaimed the throne for the Sinhalese. He ruled from Anuradhapura for ten years. However, his reign was also brought to an end by another invasion from South India, led by a Chola prince named Elara, who defeated and killed Asela to become the next ruler."},
  {"name": "King Elara (Chola/Tamil)", "slug": "elara", "kingdom": "anuradhapura", "reign": "205–161 BCE", "biography": "Elara was a Chola prince from South India who invaded Sri Lanka and took the throne of the Anuradhapura Kingdom by defeating King Asela. Despite being an invader, Elara is renowned in Sri Lankan history for his exceptionally just and impartial rule, which lasted for 44 years. The Mahavamsa chronicle, though a Sinhalese Buddhist text, praises him for his righteousness and describes his 'Bell of Justice,' which citizens could ring to demand his personal attention for any grievance. The most famous legend tells of him ordering the execution of his own son as retribution for a calf that the son's chariot had accidentally killed. His long reign was eventually challenged by the Sinhalese prince Dutugemunu from the south. The conflict culminated in a legendary duel between the two kings on elephant-back, where the elderly Elara was finally defeated and killed. Dutugemunu, in a mark of great respect, had a monument built for Elara and ordered that all should pay respect to it."},
  {"name": "King Kavan Tissa", "slug": "kavan-tissa", "kingdom": "ruhuna", "reign": "c. 2nd c. BCE", "biography": "Kavan Tissa was the king of the southern kingdom of Ruhuna during the period when the northern Anuradhapura Kingdom was under the rule of the Chola king Elara. He is most famously remembered as the father of the heroic Sinhalese king, Dutugemunu. While his son would later wage the war to unify the island, Kavan Tissa's reign was crucial in preparing for this conflict. A shrewd and pious ruler, he focused on strengthening his kingdom from within. He built numerous temples and viharas, fostering a strong sense of national and religious unity. He also gathered the resources and manpower necessary for a future war, including recruiting the 'Ten Giant Warriors' (Dasha Maha Yodhayo) who would later become instrumental in his son's campaign. His strategic foresight laid the essential groundwork for the eventual defeat of Elara and the reunification of Sri Lanka."},
  {"name": "King Dutugemunu", "slug": "dutugemunu", "kingdom": "anuradhapura", "reign": "161–137 BCE", "biography": "Dutugemunu is one of the most celebrated heroes in Sri Lankan history, revered for liberating and unifying the island under a single banner. As the son of King Kavan Tissa of Ruhuna, he was driven from a young age by the desire to expel the Chola king Elara, who ruled Anuradhapura. After his father's death and a brief conflict with his own brother, Tissa, Dutugemunu launched his famous campaign. Aided by his loyal war elephant, Kandula, and his 'Ten Giant Warriors,' he waged a series of battles, culminating in a legendary elephant-back duel where he defeated and killed the elderly King Elara. Despite being an adversary, Dutugemunu showed great respect for Elara's bravery, building a monument in his honor. As king, Dutugemunu became a great patron of Buddhism, initiating the construction of some of the most iconic structures in Anuradhapura, including the massive Ruwanwelisaya stupa and the magnificent nine-story Lovamahapaya (Brazen Palace). His reign is considered a golden age of Sinhalese nationalism and religious devotion."},
  {"name": "King Saddha Tissa", "slug": "saddha-tissa", "kingdom": "anuradhapura", "reign": "137–119 BCE", "biography": "Saddha Tissa was the brother of the hero King Dutugemunu and ruled Anuradhapura for 18 years. He was initially the ruler of Digamadulla (Eastern Province). Although he had a brief conflict with his brother over the throne after their father's death, they later reconciled. Saddha Tissa is renowned for his piety and his contribution to completing the work on the Ruwanwelisaya (Great Stupa) after Dutugemunu's death. He also built numerous viharas, including Dighavapi Vihara, and is credited with supporting the Sangha and fostering Buddhism throughout the kingdom."},
  {"name": "King Thulatthana", "slug": "thulatthana", "kingdom": "anuradhapura", "reign": "119 BCE", "biography": "Thulatthana was the second son of King Saddha Tissa. Upon his father's death, the ministers and monks at the Thuparama consecrated him as king, bypassing his elder brother Lanja Tissa. However, his reign was extremely short-lived, lasting only one month and ten days. His elder brother Lanja Tissa, who was in Ruhuna, marched to Anuradhapura, deposed Thulatthana, and seized the throne."},
  {"name": "King Lanja Tissa", "slug": "lanja-tissa", "kingdom": "anuradhapura", "reign": "119–109 BCE", "biography": "Lanja Tissa was the eldest son of King Saddha Tissa. He ascended the throne after deposing his younger brother Thulatthana. Initially, Lanja Tissa was hostile towards the Buddhist monks for supporting his brother, but he later reconciled with them. He became a great patron of Buddhism, building stone flower altars at the Ruwanwelisaya, constructing the Girikumbhila Vihara, and extending the Mahavihara. He ruled for nine years."},
  {"name": "King Khallata Naga", "slug": "khallata-naga", "kingdom": "anuradhapura", "reign": "109–103 BCE", "biography": "Khallata Naga was the third son of King Saddha Tissa and succeeded his brother Lanja Tissa. His reign of six years was marked by internal unrest. He built the Kurundi Vihara and other religious structures. His rule ended violently when he was assassinated by his own commander, a general named Kammaharattaka, within the palace grounds."},
  {"name": "King Valagamba (Vattagamani Abhaya)", "slug": "valagamba", "kingdom": "anuradhapura", "reign": "103, 89–77 BCE", "biography": "Valagamba, also known as Vattagamani Abhaya, is one of Sri Lanka's most famous kings, known for regaining the throne after a 14-year exile. He was the fourth son of Saddha Tissa. Shortly after becoming king in 103 BCE, he faced a rebellion by a Brahmin named Tiya and a simultaneous invasion by seven Tamil chiefs from South India. Defeated, he fled into hiding. For 14 years, he lived in caves and forests, gathering support. In 89 BCE, he defeated the last of the Tamil rulers, Dathika, and regained the throne. His second reign is celebrated for the construction of the Abhayagiri Dagaba and the committing of the Tripitaka (Buddhist scriptures) to writing for the first time in history at the Aluvihara in Matale."},
  {"name": "King Pulahatta", "slug": "pulahatta", "kingdom": "anuradhapura", "reign": "103–100 BCE", "biography": "Pulahatta was the first of the five Tamil chiefs who ruled Anuradhapura after defeating King Valagamba. He ruled for three years before being killed by his commander, Bahiya."},
  {"name": "King Bahiya", "slug": "bahiya", "kingdom": "anuradhapura", "reign": "100–98 BCE", "biography": "Bahiya was the second of the Tamil rulers. He killed Pulahatta to take the throne and ruled for two years before being killed by his commander, Panya Mara."},
  {"name": "King Panya Mara", "slug": "panya-mara", "kingdom": "anuradhapura", "reign": "98–91 BCE", "biography": "Panya Mara was the third Tamil ruler. He killed Bahiya and ruled for seven years before being killed by his commander, Pilaya Mara."},
  {"name": "King Pilaya Mara", "slug": "pilaya-mara", "kingdom": "anuradhapura", "reign": "91–90 BCE", "biography": "Pilaya Mara was the fourth Tamil ruler. He killed Panya Mara and ruled for seven months before being killed by his commander, Dathika."},
  {"name": "King Dathika", "slug": "dathika", "kingdom": "anuradhapura", "reign": "90–89 BCE", "biography": "Dathika was the last of the five Tamil rulers. He killed Pilaya Mara and ruled for two years until he was defeated and killed by King Valagamba, who restored the Sinhalese monarchy."},
  {"name": "King Mahakuli Mahatissa", "slug": "mahakuli-mahatissa", "kingdom": "anuradhapura", "reign": "77–63 BCE", "biography": "Mahakuli Mahatissa was the son of King Khallata Naga but was adopted by King Valagamba as his own son and successor. He was a pious and peaceful ruler who reigned for 14 years. He is known for his extreme devotion; it is said he disguised himself as a commoner to work in paddy fields and sugar mills to earn money to give alms with his own labor."},
  {"name": "King Chora Naga", "slug": "chora-naga", "kingdom": "anuradhapura", "reign": "63–51 BCE", "biography": "Chora Naga, meaning 'The Thief' or 'Rebel Naga', was the son of King Valagamba. He succeeded his adopted brother Mahakuli Mahatissa. His reign was characterized by destruction; he destroyed 18 viharas that had refused him refuge during his earlier days as a rebel. He was eventually poisoned by his own wife, Queen Anula."},
  {"name": "King Kuda Tissa", "slug": "kuda-tissa", "kingdom": "anuradhapura", "reign": "51–48 BCE"},
  {"name": "King Siva I (first)", "slug": "siva-i-first", "kingdom": "anuradhapura", "reign": "48–47 BCE"},
  {"name": "King Vatuka", "slug": "vatuka", "kingdom": "anuradhapura", "reign": "47 BCE"},
  {"name": "King Darubhatika Tissa", "slug": "darubhatika-tissa", "kingdom": "anuradhapura", "reign": "47 BCE"},
  {"name": "King Niliya", "slug": "niliya", "kingdom": "anuradhapura", "reign": "47–46 BCE"},
  {"name": "Queen Anula", "slug": "anula", "kingdom": "anuradhapura", "reign": "46–44 BCE"},
  {"name": "King Kutakanna Tissa", "slug": "kutakanna-tissa", "kingdom": "anuradhapura", "reign": "44 BCE–22 BCE"},
  {"name": "King Bhatikabhaya Abhaya", "slug": "bhatikabhaya-abhaya", "kingdom": "anuradhapura", "reign": "22 BCE–7 CE"},
  {"name": "King Mahadathika Mahanaga", "slug": "mahadathika-mahanaga", "kingdom": "anuradhapura", "reign": "7–19 CE"},
  {"name": "King Amandagamani Abhaya", "slug": "amandagamani-abhaya", "kingdom": "anuradhapura", "reign": "19–29 CE"},
  {"name": "King Kanirajanu Tissa", "slug": "kanirajanu-tissa", "kingdom": "anuradhapura", "reign": "29–32 CE"},
  {"name": "King Chulabhaya", "slug": "chulabhaya", "kingdom": "anuradhapura", "reign": "32–33 CE"},
  {"name": "Queen Sivali", "slug": "sivali", "kingdom": "anuradhapura", "reign": "33 CE"},
  {"name": "King Ilanaga", "slug": "ilanaga", "kingdom": "anuradhapura", "reign": "33–43 CE"},
  {"name": "King Chandamukha Siva", "slug": "chandamukha-siva", "kingdom": "anuradhapura", "reign": "43–52 CE"},
  {"name": "King Yassalalaka Tissa", "slug": "yassalalaka-tissa", "kingdom": "anuradhapura", "reign": "52–60 CE"},
  {"name": "King Subharaja", "slug": "subharaja", "kingdom": "anuradhapura", "reign": "60–67 CE"},
  {"name": "King Vasabha", "slug": "vasabha", "kingdom": "anuradhapura", "reign": "67–111 CE"},
  {"name": "King Vankanasika Tissa", "slug": "vankanasika-tissa", "kingdom": "anuradhapura", "reign": "111–114 CE"},
  {"name": "King Gajabahu I", "slug": "gajabahu-i", "kingdom": "anuradhapura", "reign": "114–136 CE"},
  {"name": "King Mahallaka Naga", "slug": "mahallaka-naga", "kingdom": "anuradhapura", "reign": "136–139 CE"},
  {"name": "King Bhatika Tissa", "slug": "bhatika-tissa", "kingdom": "anuradhapura", "reign": "139–167 CE"},
  {"name": "King Kanittha Tissa", "slug": "kanittha-tissa", "kingdom": "anuradhapura", "reign": "167–186 CE"},
  {"name": "King Cula Naga", "slug": "cula-naga", "kingdom": "anuradhapura", "reign": "186–191 CE"},
  {"name": "King Kuda Naga", "slug": "kuda-naga", "kingdom": "anuradhapura", "reign": "191–196 CE"},
  {"name": "King Siri Naga I", "slug": "siri-naga-i", "kingdom": "anuradhapura", "reign": "196–215 CE"},
  {"name": "King Abhaya Naga", "slug": "abhaya-naga", "kingdom": "anuradhapura", "reign": "215–237 CE"},
  {"name": "King Siri Naga II", "slug": "siri-naga-ii", "kingdom": "anuradhapura", "reign": "237–245 CE"},
  {"name": "King Voharika Tissa", "slug": "voharika-tissa", "kingdom": "anuradhapura", "reign": "245–247 CE"},
  {"name": "King Abhaya Naga II", "slug": "abhaya-naga-ii", "kingdom": "anuradhapura", "reign": "247–249 CE"},
  {"name": "King Siri Naga III", "slug": "siri-naga-iii", "kingdom": "anuradhapura", "reign": "249–251 CE"},
  {"name": "King Vijaya Kumara", "slug": "vijaya-kumara", "kingdom": "anuradhapura", "reign": "251–252 CE"},
  {"name": "King Sangha Tissa I", "slug": "sangha-tissa-i", "kingdom": "anuradhapura", "reign": "252–254 CE"},
  {"name": "King Siri Sangha Bodhi I", "slug": "siri-sangha-bodhi-i", "kingdom": "anuradhapura", "reign": "254–256 CE"},
  {"name": "King Gothabhaya", "slug": "gothabhaya", "kingdom": "anuradhapura", "reign": "256–264 CE"},
  {"name": "King Jettha Tissa II", "slug": "jettha-tissa-ii", "kingdom": "anuradhapura", "reign": "264–273 CE"},
  {"name": "King Mahasena", "slug": "mahasena", "kingdom": "anuradhapura", "reign": "273–301 CE"},
  {"name": "King Siri Meghavanna", "slug": "siri-meghavanna", "kingdom": "anuradhapura", "reign": "301–328 CE"},
  {"name": "King Jettha Tissa III", "slug": "jettha-tissa-iii", "kingdom": "anuradhapura", "reign": "328–337 CE"},
  {"name": "King Buddhadasa", "slug": "buddhadasa", "kingdom": "anuradhapura", "reign": "337–365 CE"},
  {"name": "King Upatissa I", "slug": "upatissa-i", "kingdom": "anuradhapura", "reign": "365–406 CE"},
  {"name": "King Mahanama", "slug": "mahanama", "kingdom": "anuradhapura", "reign": "406–428 CE"},
  {"name": "King Siva II (second)", "slug": "siva-ii-second", "kingdom": "anuradhapura", "reign": "428–430 CE"},
  {"name": "King Pandu (Tamil)", "slug": "pandu-tamil", "kingdom": "anuradhapura", "reign": "430–432 CE"},
  {"name": "King Parindu (Tamil)", "slug": "parindu-tamil", "kingdom": "anuradhapura", "reign": "432 CE"},
  {"name": "King Khudda Parinda (Tamil)", "slug": "khudda-parinda-tamil", "kingdom": "anuradhapura", "reign": "432–434 CE"},
  {"name": "King Tiritara (Tamil)", "slug": "tiritara-tamil", "kingdom": "anuradhapura", "reign": "434 CE"},
  {"name": "King Dathiya (Tamil)", "slug": "dathiya-tamil", "kingdom": "anuradhapura", "reign": "434–436 CE"},
  {"name": "King Pithiya (Tamil)", "slug": "pithiya-tamil", "kingdom": "anuradhapura", "reign": "436–437 CE"},
  {"name": "King Dhatusena", "slug": "dhatusena", "kingdom": "anuradhapura", "reign": "455–473 CE"},
  {"name": "King Kashyapa I", "slug": "kashyapa-i", "kingdom": "sigiriya", "reign": "473–495 CE"},
  {"name": "King Moggallana I", "slug": "moggallana-i", "kingdom": "sigiriya", "reign": "495–512 CE"},
  {"name": "King Kumara Dhatusena", "slug": "kumara-dhatusena", "kingdom": "anuradhapura", "reign": "512–524 CE"},
  {"name": "King Kittisena", "slug": "kittisena", "kingdom": "anuradhapura", "reign": "524 CE"},
  {"name": "King Siva I", "slug": "siva-i-524", "kingdom": "anuradhapura", "reign": "524–525 CE"},
  {"name": "King Upatissa II", "slug": "upatissa-ii", "kingdom": "anuradhapura", "reign": "525–526 CE"},
  {"name": "King Silakala Ambosamanera", "slug": "silakala-ambosamanera", "kingdom": "anuradhapura", "reign": "526–539 CE"},
  {"name": "King Aggabodhi I", "slug": "aggabodhi-i", "kingdom": "anuradhapura", "reign": "564–598 CE"},
  {"name": "King Kassapa II", "slug": "kassapa-ii", "kingdom": "anuradhapura", "reign": "602–608 CE"},
  {"name": "King Aggabodhi II", "slug": "aggabodhi-ii", "kingdom": "anuradhapura", "reign": "608–618 CE"},
  {"name": "King Sangha Tissa II", "slug": "sangha-tissa-ii", "kingdom": "anuradhapura", "reign": "608–614 CE"},
  {"name": "King Dathopa Tissa I", "slug": "dathopa-tissa-i", "kingdom": "anuradhapura", "reign": "614–623 CE"},
  {"name": "King Aggabodhi III", "slug": "aggabodhi-iii", "kingdom": "anuradhapura", "reign": "626–636 CE"},
  {"name": "King Kassapa III", "slug": "kassapa-iii", "kingdom": "anuradhapura", "reign": "732–738 CE"},
  {"name": "King Mahinda I", "slug": "mahinda-i", "kingdom": "anuradhapura", "reign": "738–746 CE"},
  {"name": "King Aggabodhi VI", "slug": "aggabodhi-vi", "kingdom": "anuradhapura", "reign": "771–781 CE"},
  {"name": "King Mahinda II", "slug": "mahinda-ii", "kingdom": "anuradhapura", "reign": "781–797 CE"},
  {"name": "King Siri Sangha Bodhi II", "slug": "siri-sangha-bodhi-ii", "kingdom": "anuradhapura", "reign": "797–801 CE"},
  {"name": "King Mahinda III", "slug": "mahinda-iii", "kingdom": "anuradhapura", "reign": "801–804 CE"},
  {"name": "King Dappula I", "slug": "dappula-i", "kingdom": "anuradhapura", "reign": "804–835 CE"},
  {"name": "King Dappula II", "slug": "dappula-ii", "kingdom": "anuradhapura", "reign": "835–836 CE"},
  {"name": "King Sena I", "slug": "sena-i", "kingdom": "anuradhapura", "reign": "833–853 CE"},
  {"name": "King Sena II", "slug": "sena-ii", "kingdom": "anuradhapura", "reign": "853–887 CE"},
  {"name": "King Udaya I", "slug": "udaya-i", "kingdom": "anuradhapura", "reign": "887–898 CE"},
  {"name": "King Kassapa IV", "slug": "kassapa-iv", "kingdom": "anuradhapura", "reign": "898–914 CE"},
  {"name": "King Kassapa V", "slug": "kassapa-v", "kingdom": "anuradhapura", "reign": "914–923 CE"},
  {"name": "King Dappula IV", "slug": "dappula-iv", "kingdom": "anuradhapura", "reign": "923–924 CE"},
  {"name": "King Kassapa VI", "slug": "kassapa-vi", "kingdom": "anuradhapura", "reign": "924–935 CE"},
  {"name": "King Sena III", "slug": "sena-iii", "kingdom": "anuradhapura", "reign": "936–945 CE"},
  {"name": "King Udaya II", "slug": "udaya-ii", "kingdom": "anuradhapura", "reign": "946–954 CE"},
  {"name": "King Sena IV", "slug": "sena-iv", "kingdom": "anuradhapura", "reign": "954–956 CE"},
  {"name": "King Mahinda IV", "slug": "mahinda-iv", "kingdom": "anuradhapura", "reign": "956–972 CE"},
  {"name": "King Sena V", "slug": "sena-v", "kingdom": "anuradhapura", "reign": "972–975 CE"},
  {"name": "King Mahinda V", "slug": "mahinda-v", "kingdom": "anuradhapura", "reign": "982–1017 CE"},
  {"name": "King Vijayabahu I", "slug": "vijayabahu-i", "kingdom": "polonnaruwa", "reign": "1055–1110"},
  {"name": "King Jayabahu I", "slug": "jayabahu-i", "kingdom": "polonnaruwa", "reign": "1110–1111"},
  {"name": "King Vikramabahu I", "slug": "vikramabahu-i", "kingdom": "polonnaruwa", "reign": "1111–1132"},
  {"name": "King Gajabahu II", "slug": "gajabahu-ii", "kingdom": "polonnaruwa", "reign": "1132–1153"},
  {"name": "King Parakramabahu I", "slug": "parakramabahu-i", "kingdom": "polonnaruwa", "reign": "1153–1186"},
  {"name": "King Nissanka Malla", "slug": "nissanka-malla", "kingdom": "polonnaruwa", "reign": "1187–1196"},
  {"name": "King Sahasa Malla", "slug": "sahasa-malla", "kingdom": "polonnaruwa", "reign": "1200–1202"},
  {"name": "Queen Kalyanavati", "slug": "kalyanavati", "kingdom": "polonnaruwa", "reign": "1202–1208"},
  {"name": "King Dharmasoka", "slug": "dharmasoka", "kingdom": "polonnaruwa", "reign": "1208–1209"},
  {"name": "King Anikanga", "slug": "anikanga", "kingdom": "polonnaruwa", "reign": "1209"},
  {"name": "Queen Lilavati", "slug": "lilavati", "kingdom": "polonnaruwa", "reign": "1197–1200, 1209–1210, 1211–1212"},
  {"name": "King Lokissara", "slug": "lokissara", "kingdom": "polonnaruwa", "reign": "1210–1211"},
  {"name": "King Parakrama Pandya II", "slug": "parakrama-pandya-ii", "kingdom": "polonnaruwa", "reign": "1212–1215"},
  {"name": "King Kalinga Magha", "slug": "kalinga-magha-polonnaruwa", "kingdom": "polonnaruwa", "reign": "1215–1236"},
  {"name": "King Vijayabahu III", "slug": "vijayabahu-iii", "kingdom": "dambadeniya", "reign": "1236–1270"},
  {"name": "King Parakramabahu II", "slug": "parakramabahu-ii", "kingdom": "dambadeniya", "reign": "1270–1284"},
  {"name": "King Bhuvanaikabahu I", "slug": "bhuvanaikabahu-i", "kingdom": "yapahuwa", "reign": "1284–1291"},
  {"name": "King Parakramabahu IV", "slug": "parakramabahu-iv", "kingdom": "yapahuwa", "reign": "1291–1302"},
  {"name": "King Bhuvanaikabahu II", "slug": "bhuvanaikabahu-ii", "kingdom": "kurunegala", "reign": "1302–1326"},
  {"name": "King Vijayabahu V", "slug": "vijayabahu-v", "kingdom": "kurunegala", "reign": "1326–1341"},
  {"name": "King Bhuvanaikabahu IV", "slug": "bhuvanaikabahu-iv", "kingdom": "gampola", "reign": "1341–1351"},
  {"name": "King Parakramabahu V", "slug": "parakramabahu-v", "kingdom": "gampola", "reign": "1351–1353"},
  {"name": "King Vikramabahu III", "slug": "vikramabahu-iii", "kingdom": "gampola", "reign": "1357–1374"},
  {"name": "King Bhuvanaikabahu V", "slug": "bhuvanaikabahu-v", "kingdom": "gampola", "reign": "1372–1391"},
  {"name": "King Vira Alakesvara", "slug": "vira-alakesvara", "kingdom": "gampola", "reign": "1391–1392"},
  {"name": "King Parakramabahu VI", "slug": "parakramabahu-vi", "kingdom": "kotte", "reign": "1412–1467"},
  {"name": "King Bhuvanaikabahu VI", "slug": "bhuvanaikabahu-vi", "kingdom": "kotte", "reign": "1467–1472"},
  {"name": "King Parakramabahu VII", "slug": "parakramabahu-vii", "kingdom": "kotte", "reign": "1472–1480"},
  {"name": "King Parakramabahu VIII", "slug": "parakramabahu-viii", "kingdom": "kotte", "reign": "1484–1518"},
  {"name": "King Dharma Parakramabahu IX", "slug": "dharma-parakramabahu-ix", "kingdom": "kotte", "reign": "1518–1521"},
  {"name": "King Vijayabahu VI", "slug": "vijayabahu-vi", "kingdom": "kotte", "reign": "1521"},
  {"name": "King Bhuvanaikabahu VII", "slug": "bhuvanaikabahu-vii", "kingdom": "kotte", "reign": "1521–1551"},
  {"name": "King Dharmapala", "slug": "dharmapala", "kingdom": "kotte", "reign": "1551–1597"},
  {"name": "King Mayadunne", "slug": "mayadunne", "kingdom": "sitawaka", "reign": "1521–1581"},
  {"name": "King Rajasinha I", "slug": "rajasinha-i", "kingdom": "sitawaka", "reign": "1581–1593"},
  {"name": "King Senasammata Vikramabahu", "slug": "senasammata-vikramabahu", "kingdom": "kandyan", "reign": "1469–1511"},
  {"name": "King Jayaweera Astana", "slug": "jayaweera-astana", "kingdom": "kandyan", "reign": "1511–1552"},
  {"name": "King Karaliadde Bandara", "slug": "karaliadde-bandara", "kingdom": "kandyan", "reign": "1551–1581"},
  {"name": "King Don Juan Bandara", "slug": "don-juan-bandara", "kingdom": "kandyan", "reign": "1581–1590"},
  {"name": "King Vimaladharmasuriya I", "slug": "vimaladharmasuriya-i", "kingdom": "kandyan", "reign": "1590–1604"},
  {"name": "King Senarat", "slug": "senarat", "kingdom": "kandyan", "reign": "1604–1635"},
  {"name": "King Rajasinha II", "slug": "rajasinha-ii", "kingdom": "kandyan", "reign": "1635–1687"},
  {"name": "King Vimaladharmasuriya II", "slug": "vimaladharmasuriya-ii", "kingdom": "kandyan", "reign": "1687–1707"},
  {"name": "King Narendra Sinha", "slug": "narendra-sinha", "kingdom": "kandyan", "reign": "1707–1739"},
  {"name": "King Sri Vijaya Rajasinha", "slug": "sri-vijaya-rajasinha", "kingdom": "kandyan", "reign": "1739–1747"},
  {"name": "King Kirti Sri Rajasinha", "slug": "kirti-sri-rajasinha", "kingdom": "kandyan", "reign": "1747–1781"},
  {"name": "King Rajadhi Rajasinha", "slug": "rajadhi-rajasinha", "kingdom": "kandyan", "reign": "1781–1798"},
  {"name": "King Sri Vikrama Rajasinha", "slug": "sri-vikrama-rajasinha", "kingdom": "kandyan", "reign": "1798–1815"},
  {"name": "King Kalinga Magha", "slug": "kalinga-magha-jaffna", "kingdom": "jaffna", "reign": "1215–1236"},
  {"name": "King Cinkai Aryan I", "slug": "cinkai-aryan-i", "kingdom": "jaffna", "reign": "1277–1284"},
  {"name": "King Varodaya Cinkai Aryan", "slug": "varodaya-cinkai-aryan", "kingdom": "jaffna", "reign": "1284–1292"},
  {"name": "King Cinkai Aryan II", "slug": "cinkai-aryan-ii", "kingdom": "jaffna", "reign": "1292–1342"},
  {"name": "King Vickrama Cinkai Aryan", "slug": "vickrama-cinkai-aryan", "kingdom": "jaffna", "reign": "1342–1380"},
  {"name": "King Varodaya Cinkai Aryan III", "slug": "varodaya-cinkai-aryan-iii", "kingdom": "jaffna", "reign": "1380–1410"},
  {"name": "King Martanda Cinkai Aryan", "slug": "martanda-cinkai-aryan", "kingdom": "jaffna", "reign": "1410–1440"},
  {"name": "King Kanakasooriya Cinkai Aryan I", "slug": "kanakasooriya-cinkai-aryan-i", "kingdom": "jaffna", "reign": "1440–1467"},
  {"name": "King Singai Pararasasekaran VI", "slug": "singai-pararasasekaran-vi", "kingdom": "jaffna", "reign": "1467–1519"},
  {"name": "King Pararacacekaran VII", "slug": "pararacacekaran-vii", "kingdom": "jaffna", "reign": "1519–1561"},
  {"name": "King Cankili I", "slug": "cankili-i", "kingdom": "jaffna", "reign": "1561–1565"},
  {"name": "King Puviraja Pandaram", "slug": "puviraja-pandaram", "kingdom": "jaffna", "reign": "1565"},
  {"name": "King Periyapillai", "slug": "periyapillai", "kingdom": "jaffna", "reign": "1565–1582"},
  {"name": "King Cankili II", "slug": "cankili-ii", "kingdom": "jaffna", "reign": "1617–1619"}
]